articles/palace.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-11-10 Mon 01:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Virtual Memory Palace</title>
<meta name="author" content="Eryk Banatt" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="https://planetbanatt.net/css/default_20240614.css" />
<link rel="shortcut icon" type="image/jpg" href="https://planetbanatt.net/favicon.ico" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee/index.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</a></li>
            <li class="dark-mode-nav-item"><a href="#" class="dark-mode-toggle-nav" onclick="toggleDarkMode(); return false;">🌙</a></li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content" class="content">
<h1 class="title">Virtual Memory Palace</h1>
<div id="table-of-contents" role="doc-toc">
<h1>Table of Contents</h1>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org98fc718">Building a Virtual Memory Palace</a>
<ul>
<li><a href="#org4317915">Baseline: Noclip.website</a></li>
<li><a href="#org988b319">Billboarding</a></li>
<li><a href="#orgd34ae36">Gravity, Textboxes</a></li>
<li><a href="#orga530546">More TODOs</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org98fc718" class="outline-1">
<h1 id="org98fc718">Building a Virtual Memory Palace</h1>
<div class="outline-text-1" id="text-org98fc718">
<blockquote class="bluesky-embed" data-bluesky-uri="at://did:plc:yadaiiqxuhlbdenc6y4tdk7c/app.bsky.feed.post/3m5asopwy622g" data-bluesky-cid="bafyreihqysa7z5bz2765wst6ldhv7vmqfzv3vlbfy47kw4oluwjluyqwom" data-bluesky-embed-color-mode="system"><p lang="en">fuck you *re-clips your noclip*<br><br><a href="https://bsky.app/profile/did:plc:yadaiiqxuhlbdenc6y4tdk7c/post/3m5asopwy622g?ref_src=embed">[image or embed]</a></p>&mdash; Eryk (<a href="https://bsky.app/profile/did:plc:yadaiiqxuhlbdenc6y4tdk7c?ref_src=embed">@ambisinister.planetbanatt.net</a>) <a href="https://bsky.app/profile/did:plc:yadaiiqxuhlbdenc6y4tdk7c/post/3m5asopwy622g?ref_src=embed">November 9, 2025 at 8:42 PM</a></blockquote><script async src="https://embed.bsky.app/static/embed.js" charset="utf-8"></script>

<p>
I've <a href="https://planetbanatt.net/articles/memorycraft.html">written a little</a> bit <a href="https://planetbanatt.net/articles/memory.html">about memory sports</a> on here before. One very powerful technique is <a href="https://en.wikipedia.org/wiki/Method_of_loci">memory palaces</a>, also known as method of loci or roman rooms. I've had good success with this technique, mostly for idle stuff like memorizing playing cards in a short period of time.
</p>

<p>
But I've found these techniques are mostly useful for quickly memorizing something arbitrary in a short period of time, in an ephemeral way. Compared to stuff like <a href="https://planetbanatt.net/articles/anki.html">anki</a> it felt like these techniques were mostly targeted at high-level cramming, or winning at memory competitions. 
</p>

<p>
I think this need not be the case, so I'm attempting to create a persistent store for these sorts of memories with this project. This post is more of a dev log: I want to build something useful for my own personal use, and will likely be messing with it over time. 
</p>
</div>

<div id="outline-container-org4317915" class="outline-2">
<h2 id="org4317915">Baseline: Noclip.website</h2>
<div class="outline-text-2" id="text-org4317915">
<p>
I love <a href="https://noclip.website/">noclip.website</a>. The people who made it are very smart and have built a really cool thing, and it's fun and nostalgic flying around everywhere in these old game maps.
</p>

<p>
I am going to fork their repo for this, and add a bunch of stuff which lets me modify the world. This should let me "place things" just like how I would in a memory palace, and create a persistent world which won't degrade with time. A lot of people use journals which contain which things are supposed to be in which locations, but I'm a digital native sort of guy. 
</p>
</div>
</div>

<div id="outline-container-org988b319" class="outline-2">
<h2 id="org988b319">Billboarding</h2>
<div class="outline-text-2" id="text-org988b319">
<p>
[11/5/25] The first big hurdle after getting everything running was spawning objects in the world. Since 3d stuff is way beyond my pay grade, I elected to do this by using billboards: 2d planes in the world which always face the camera. This way I could have them be occluded by other geometry, and have them look psuedo 3d. The intent of this is for it to all just exist in my mind when I'm not looking at it anyways, so it doesn't have to be too pretty.
</p>

<p>
This was super difficult for me. I'm not a big frontend guy, so using typescript was very difficult for me. But I figured it out eventually, and was able to successfully spawn Bocchi in Kokiri Forest. 
</p>

<blockquote class="bluesky-embed" data-bluesky-uri="at://did:plc:yadaiiqxuhlbdenc6y4tdk7c/app.bsky.feed.post/3m4wjpmucmc2p" data-bluesky-cid="bafyreigkziaqio5263sppoxkkjxyclytqyhgxee5viv46mfbazo5zpfary" data-bluesky-embed-color-mode="system"><p lang="en">doing stupid shit instead of something productive<br><br><a href="https://bsky.app/profile/did:plc:yadaiiqxuhlbdenc6y4tdk7c/post/3m4wjpmucmc2p?ref_src=embed">[image or embed]</a></p>&mdash; Eryk (<a href="https://bsky.app/profile/did:plc:yadaiiqxuhlbdenc6y4tdk7c?ref_src=embed">@ambisinister.planetbanatt.net</a>) <a href="https://bsky.app/profile/did:plc:yadaiiqxuhlbdenc6y4tdk7c/post/3m4wjpmucmc2p?ref_src=embed">November 5, 2025 at 6:35 PM</a></blockquote><script async src="https://embed.bsky.app/static/embed.js" charset="utf-8"></script>
</div>
</div>

<div id="outline-container-orgd34ae36" class="outline-2">
<h2 id="orgd34ae36">Gravity, Textboxes</h2>
<div class="outline-text-2" id="text-orgd34ae36">
<p>
[11/10/25] I added gravity, interactable textboxes, and the ability to upload your own images rather than every single billboard just being Bocchi. The basic functionality is really starting to come together now! It feels almost like a game now, since I can run around and place things.
</p>

<blockquote class="bluesky-embed" data-bluesky-uri="at://did:plc:yadaiiqxuhlbdenc6y4tdk7c/app.bsky.feed.post/3m5asopwy622g" data-bluesky-cid="bafyreihqysa7z5bz2765wst6ldhv7vmqfzv3vlbfy47kw4oluwjluyqwom" data-bluesky-embed-color-mode="system"><p lang="en">fuck you *re-clips your noclip*<br><br><a href="https://bsky.app/profile/did:plc:yadaiiqxuhlbdenc6y4tdk7c/post/3m5asopwy622g?ref_src=embed">[image or embed]</a></p>&mdash; Eryk (<a href="https://bsky.app/profile/did:plc:yadaiiqxuhlbdenc6y4tdk7c?ref_src=embed">@ambisinister.planetbanatt.net</a>) <a href="https://bsky.app/profile/did:plc:yadaiiqxuhlbdenc6y4tdk7c/post/3m5asopwy622g?ref_src=embed">November 9, 2025 at 8:42 PM</a></blockquote><script async src="https://embed.bsky.app/static/embed.js" charset="utf-8"></script>

<blockquote class="bluesky-embed" data-bluesky-uri="at://did:plc:yadaiiqxuhlbdenc6y4tdk7c/app.bsky.feed.post/3m5av7xatl222" data-bluesky-cid="bafyreih5373ifshu6axaxq75x5dzy6vra7jrbkkia5qt2mfo4qvt46liea" data-bluesky-embed-color-mode="system"><p lang="en">what is your wisdom<br><br><a href="https://bsky.app/profile/did:plc:yadaiiqxuhlbdenc6y4tdk7c/post/3m5av7xatl222?ref_src=embed">[image or embed]</a></p>&mdash; Eryk (<a href="https://bsky.app/profile/did:plc:yadaiiqxuhlbdenc6y4tdk7c?ref_src=embed">@ambisinister.planetbanatt.net</a>) <a href="https://bsky.app/profile/did:plc:yadaiiqxuhlbdenc6y4tdk7c/post/3m5av7xatl222?ref_src=embed">November 9, 2025 at 9:28 PM</a></blockquote><script async src="https://embed.bsky.app/static/embed.js" charset="utf-8"></script>
</div>
</div>

<div id="outline-container-orga530546" class="outline-2">
<h2 id="orga530546">More TODOs</h2>
<div class="outline-text-2" id="text-orga530546">
<ul class="org-ul">
<li>I need to be able to modify a billboard's text value obviously</li>
<li>The billboards need to persist, they need to be loaded from a database</li>
<li>Get more maps than just kokiri forest</li>
<li>Do I need to rewrite this for non zelda games?</li>
<li>I need to add billboards which act as pseudo loading zones to go to new locations</li>
<li>I need to write in some way to generate imagery or download it via search</li>
<li>Billboard adjustment is super cumbersome right now</li>
<li>Billboard management in general, probably good to teleport to each in addition to moving around</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
</div>
</body>
</html>
